Catalogs/НастройкиЗакрытияМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>НастройкиЗакрытияМесяца</Name>
			<Comment>Список настроек закрытия месяца</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействияНастройки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РегламентныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегламентнаяОперация</Name>
							<Type>
								<v8:Type>cfg:BusinessProcessRoutePointRef.ЗакрытиеМесяца</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражатьВУправленческомУчете</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражатьВБухгалтерскомУчете</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнятьАвтоматически</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиЗакрытияМесяца/Ext/ObjectModule.bsl
//Процедура выполняет первоначальное заполнение настроек 
//- при вводе нового элемента справочника
Процедура ЗаполнитьСписокРегламентныхОпераций(ОбъектКопирования = Неопределено, Использовать = Истина) Экспорт
	
	ТаблицаРеглОпераций = РегламентныеОперации.Выгрузить();
	ТаблицаРеглОпераций.Очистить();
	ТаблицаРеглОпераций.Колонки.Добавить("Порядок");
	
	ОбрабатываемыеБизнесПроцессы = Новый Массив();
	ОбрабатываемыеБизнесПроцессы.Добавить("ЗакрытиеМесяца");
	
	ТочкиМаршрута = БизнесПроцессЗакрытиеМесяца.ПолучитьТочкиМаршрутаЗакрытияМесяцаИРасчетаНДС(ОбрабатываемыеБизнесПроцессы);
	
	Макет = ПолучитьМакет("МакетНастроекПоУмолчанию");
	ОбластьСписокНастроек = Макет.Области.Найти("Список");
	
	Если ОбластьСписокНастроек <> Неопределено Тогда
		
		ОбластьСписокНастроек = Макет.ПолучитьОбласть("Список");
		
		Для Каждого ТочкаМаршрута ИЗ ТочкиМаршрута Цикл
			
			ОбластьТочкаМаршрута = ОбластьСписокНастроек.НайтиТекст(ТочкаМаршрута.Имя,,,Истина,Истина,,Истина);
			Если ОбластьТочкаМаршрута = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяОбласти_Начало = Лев(ОбластьТочкаМаршрута.Имя,СтрДлина(ОбластьТочкаМаршрута.Имя)-1);
			УУ = Булево(Число(СокрЛП(ОбластьСписокНастроек.Область(ИмяОбласти_Начало+"2").Текст)));
			БУ = Булево(Число(СокрЛП(ОбластьСписокНастроек.Область(ИмяОбласти_Начало+"3").Текст)));

			НоваяСтрока = ТаблицаРеглОпераций.Добавить();
			НоваяСтрока.РегламентнаяОперация = ТочкаМаршрута;
			НоваяСтрока.ОтражатьВУправленческомУчете = УУ;
			НоваяСтрока.ОтражатьВБухгалтерскомУчете = БУ;
			НоваяСтрока.Использовать = Использовать;
			НоваяСтрока.Порядок = ОбластьТочкаМаршрута.Верх;
			
			Если ОбъектКопирования <> Неопределено Тогда
				
				СтрокаОбъектаКопирования = Неопределено;
				
				Для Каждого ТекСтрокаОбъектаКопирования ИЗ ОбъектКопирования.РегламентныеОперации Цикл
					Если ЗначениеЗаполнено(ТекСтрокаОбъектаКопирования.РегламентнаяОперация) И 
						ТекСтрокаОбъектаКопирования.РегламентнаяОперация.Имя = ТочкаМаршрута.Имя Тогда
						СтрокаОбъектаКопирования = ТекСтрокаОбъектаКопирования;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если СтрокаОбъектаКопирования <> Неопределено Тогда
					НоваяСтрока.Использовать 	= СтрокаОбъектаКопирования.Использовать;
					НоваяСтрока.Ответственный 	= СтрокаОбъектаКопирования.Ответственный;
				КонецЕсли;
				
			КонецЕсли;
			
			
		КонецЦикла;
		
		ТаблицаРеглОпераций.Сортировать("Порядок");
		РегламентныеОперации.Очистить();
		РегламентныеОперации.Загрузить(ТаблицаРеглОпераций);
		ОтключитьНедоступныеРегламентныеОперации();
		
	КонецЕсли; 
	
КонецПроцедуры

//Процедура отключает регламентные операции, которые являются недоступными
//
Процедура ОтключитьНедоступныеРегламентныеОперации(МассивНедоступныхРегламентныхОпераций = Неопределено) Экспорт
	
	Если МассивНедоступныхРегламентныхОпераций = Неопределено Тогда
		МассивНедоступныхРегламентныхОпераций = БизнесПроцессЗакрытиеМесяца.ЗаполнитьМассивНедоступныхРегламентныхОпераций(
												 ?(ЗначениеЗаполнено(ДатаНачалаДействияНастройки),ДатаНачалаДействияНастройки,ТекущаяДата())
											     , // Организация
											     ,"ИзСправочникаНастроек"
											    );
	КонецЕсли;
	Если МассивНедоступныхРегламентныхОпераций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ из РегламентныеОперации Цикл
		Если НЕ СтрокаТЧ.Использовать Тогда
			Продолжить;
		КонецЕсли;
		Если БизнесПроцессЗакрытиеМесяца.РегламентнаяОперацияНедоступна(СтрокаТЧ.РегламентнаяОперация, МассивНедоступныхРегламентныхОпераций) Тогда
			СтрокаТЧ.Использовать = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаНачалаДействияНастройки = Дата('00010101000000') Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала действия настройки", Отказ);
	КонецЕсли;
	Если НЕ (ОтражатьВУправленческомУчете ИЛИ ОтражатьВБухгалтерскомУчете) Тогда	
		ОбщегоНазначения.СообщитьОбОшибке("Не установлены признаки отражения в учете", Отказ);
	КонецЕсли;
	
	Строка = РегламентныеОперации.Найти(Истина, "Использовать");
	Если Строка = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не включена ни одна регламентная операция", Отказ);
	КонецЕсли;
		
КонецПроцедуры
